In [1]:
import numpy as np
import pandas as pd

In [9]:
df = pd.read_excel("c:/users/croma campus/Downloads/Financial_Sample.xlsx").bfill()

In [10]:
df.shape

(700, 16)

In [11]:
df.isnull().sum()

Segment                0
Country                0
Product                0
Discount Band          0
Units Sold             0
Manufacturing Price    0
Sale Price             0
Gross Sales            0
Discounts              0
 Sales                 0
COGS                   0
Profit                 0
Date                   0
Month Number           0
Month Name             0
Year                   0
dtype: int64

In [12]:
df.columns

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Units Sold',
       'Manufacturing Price', 'Sale Price', 'Gross Sales', 'Discounts',
       ' Sales', 'COGS', 'Profit', 'Date', 'Month Number', 'Month Name',
       'Year'],
      dtype='object')

In [15]:
df.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,Low,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,Low,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014

In [17]:
pbs = df.groupby('Segment').agg({'Profit':'sum'}).reset_index()

In [18]:
pbs

            Segment        Profit
0  Channel Partners  1.296031e+06
1        Enterprise -4.753896e+05
2        Government  1.126979e+07
3         Midmarket  6.601031e+05
4    Small Business  4.143168e+06

In [22]:
psp = df.groupby(['Segment','Product']).agg({'Profit':'sum'}).reset_index()

In [23]:
psp

             Segment    Product       Profit
0   Channel Partners   Amarilla   220635.300
1   Channel Partners  Carretera   201339.840
2   Channel Partners    Montana   192457.560
3   Channel Partners      Paseo   322342.560
4   Channel Partners        VTT   219765.960
5   Channel Partners       Velo   139489.440
6         Enterprise   Amarilla   -95152.500
7         Enterprise  Carretera  -222711.875
8         Enterprise    Montana   -31096.250
9         Enterprise      Paseo    54430.000
10        Enterprise        VTT   -96571.250
11        Enterprise       Velo   -84287.750
12        Government   Amarilla  2206389.260
13        Government  Carretera  1417405.470
14        Government    Montana  1126201.020
15        Government      Paseo  2930616.540
16        Government        VTT  1840653.710
17        Government       Velo  1748523.650
18         Midmarket   Amarilla    63605.450
19         Midmarket  Carretera    94105.000
20         Midmarket    Montana    83879.050
21         Midmarket      Paseo   258739.350
22         Midmarket        VTT    91120.850
23         Midmarket       Velo    68653.375
24    Small Business   Amarilla   407281.000
25    Small Business  Carretera   348012.000
26    Small Business    Montana   743313.500
27    Small Business      Paseo  1231309.500
28    Small Business        VTT   982150.000
29    Small Business       Velo   431102.500

In [25]:
df.Segment.value_counts()

Segment
Government          299
Enterprise          102
Midmarket           100
Small Business      100
Channel Partners     99
Name: count, dtype: int64

In [27]:
df.Segment.unique()

array(['Government', 'Midmarket', 'Channel Partners', 'Enterprise',
       'Small Business'], dtype=object)

In [28]:
df.Segment.nunique()

5

In [32]:
df[df['Profit']>250000]

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
192,Government,Canada,Paseo,Low,3450.0,10,350.0,1207500.0,48300.0,1159200.0,897000.0,262200.0,2014-07-01,7,July,2014

In [37]:
customer = pd.read_excel("c:/users/croma campus/Downloads/Ecomm.xlsx" , sheet_name='CustomerDetail')

In [39]:
customer.shape

(24, 12)

In [48]:
orders = pd.read_excel("c:/users/croma campus/Downloads/Ecomm.xlsx" , sheet_name='Jan')

In [41]:
orders.shape

(1952, 8)

In [42]:
customer.isnull().sum()

CustomerID           0
CustomerID.1         0
Order Date           0
Month                0
MonthName            0
DateInText           0
Customer Name        0
State or Province    0
City                 0
Gender               0
Gender.1             0
Gender.2             0
dtype: int64

In [45]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [47]:
customer = customer.drop(columns = ['CustomerID','Month','DateInText','Gender','Gender.1'])

In [49]:
customer.head(2)

,CustomerID.1,Order Date,MonthName,Customer Name,State or Province,City,Gender.2
0,7253,2015-01-07,Jan,Bonnie Potter,Washington,Anacortes,MALE
1,4875,2015-06-13,Jun,Ronnie Proctor,California,San Gabriel,FEMALE

In [53]:
customer = customer.rename(columns = {'CustomerID.1':'CustomerID','Gender.2':'Gender'})

In [54]:
customer.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Jan,Bonnie Potter,Washington,Anacortes,MALE
1,4875,2015-06-13,Jun,Ronnie Proctor,California,San Gabriel,FEMALE

In [55]:
orders.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [58]:
df = pd.merge(orders,customer, on='CustomerID' , how='inner')

In [59]:
df.shape

(1952, 14)

In [60]:
df.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode,Order Date,MonthName,Customer Name,State or Province,City,Gender
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,MALE
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,FEMALE

In [64]:
pbc = df.groupby('City').agg({'Profit':'sum'}).reset_index()

In [65]:
pbc

            City        Profit
0    Grants Pass  32931.504260
1        Gresham  11531.409114
2         Helena  -2652.565420
3  Laguna Niguel  11289.841504
4       Lakewood  20596.606812
5       Missoula  17943.911089
6  New York City  46241.708660
7     Prior Lake  34330.365504
8      Smithtown  29362.161433
9       Syracuse  22539.698882

In [81]:
df = pd.read_csv("c:/users/croma campus/Downloads/final_dataset.csv").bfill()

In [82]:
df.shape

(33600, 23)

In [83]:
df.head(1)

,id,Title,Movie Link,Year,Duration,MPA,Rating,Votes,budget,grossWorldWide,...,writers,stars,genres,countries_origin,filming_locations,production_companies,Languages,wins,nominations,oscars
0,tt0073195,Jaws,https://www.imdb.com/title/tt0073195,1975,2h 4m,PG,8.1,683K,7000000.0,477220580.0,...,"['Peter Benchley', 'Carl Gottlieb']","['Roy Scheider', 'Robert Shaw', 'Richard Dreyf...","['Monster Horror', 'Sea Adventure', 'Survival'...",['United States'],"[""Water Street, Edgartown, Martha's Vineyard, ...","['Zanuck/Brown Productions', 'Universal Pictur...",['English'],0,20,0

In [84]:
df.Year.sort_values()

29451    1960
29450    1960
29471    1960
29470    1960
29469    1960
         ...
8945     2024
8946     2024
8947     2024
8948     2024
8949     2024
Name: Year, Length: 33600, dtype: int64

In [85]:
df.Duration

0         2h 4m
1        1h 40m
2        2h 13m
3         2h 5m
4        1h 50m
          ...
33595     2h 7m
33596    1h 25m
33597    1h 31m
33598    1h 30m
33599    1h 18m
Name: Duration, Length: 33600, dtype: object

In [86]:
df.Duration.unique()

array(['2h 4m', '1h 40m', '2h 13m', '2h 5m', '1h 50m', '1h 53m', '2h 16m',
       '1h 51m', '1h 57m', '1h 58m', '1h 47m', '1h 25m', '1h 37m',
       '2h 1m', '2h 9m', '1h 59m', '1h 44m', '2h 40m', '1h 39m', '1h 31m',
       '1h 46m', '2h 6m', '1h 24m', '1h 55m', '1h 35m', '1h 49m',
       '1h 56m', '1h 48m', '1h 36m', '3h 5m', '1h 20m', '1h 29m',
       '1h 38m', '1h 28m', '2h 7m', '3h 22m', '1h 30m', '1h 27m',
       '1h 33m', '2h 22m', '1h 45m', '2h 42m', '2h 24m', '2h 20m',
       '1h 23m', '2h 54m', '1h 52m', '1h 42m', '2h', '2h 2m', '1h 34m',
       '1h 32m', '1h 15m', '2h 12m', '1h 43m', '2h 32m', '1h 41m',
       '1h 14m', '1h 26m', '2h 26m', '2h 15m', '2h 30m', '2h 10m',
       '1h 22m', '1h 16m', '1h 21m', '1h 13m', '53m', '1h 19m', '3h 50m',
       '2h 38m', '2h 25m', '2h 43m', '2h 50m', '2h 36m', '1h 1m',
       '1h 18m', '2h 39m', '2h 19m', '1h 7m', '2h 11m', '1h 54m',
       '1h 17m', '1h 9m', '2h 3m', '2h 33m', '2h 57m', '1h 3m', '2h 35m',
       '2h 23m', '1h 12m', '2h 18m', '2h 55m', '2h 8m', '2h 45m', '4h',
       '2h 17m', '1h 10m', '3h 4m', '1h 11m', '1h 6m', '1h 8m', '2h 49m',
       '2h 41m', '7h 22m', '1h 5m', '1h 2m', '2h 29m', '56m', '3h',
       '2h 46m', '3h 53m', '2h 48m', '3h 2m', '2h 21m', '3h 30m',
       '2h 58m', '3h 9m', '2h 14m', '2h 56m', '59m', '2h 53m', '1h',
       '48m', '2h 52m', '2h 28m', '55m', '50m', '2h 44m', '2h 34m', '47m',
       '2h 27m', '2h 51m', '3h 11m', '3h 8m', '3h 3m', '3h 40m', '3h 14m',
       '4h 15m', '2h 31m', '57m', '45m', '52m', '2h 37m', '2h 47m',
       '3h 58m', '3h 17m', '4h 11m', '3h 52m', '4h 12m', '3h 36m',
       '1h 4m', '3h 13m', '3h 1m', '3h 18m', '2h 59m', '3h 49m', '3h 7m',
       '49m', '51m', '4h 30m', '3h 12m', '3h 6m', '3h 10m', '54m', '46m',
       'PG-13', '3h 39m', '3h 33m', '3h 15m', '58m', '3h 21m', '3h 35m',
       '4h 47m', '3h 57m', '43m', '3h 34m', '5h 35m', '3h 19m', '5h 10m',
       '3h 55m', '4h 20m', '5h 20m', '25h', '5h 57m', '87h', '40m',
       '3h 47m', '3h 25m', '3h 27m', '3h 16m', '3h 20m', '3h 41m',
       '3h 44m', '48h', '5h 19m', '4h 6m', '5h 17m', '4h 4m', '4h 10m',
       '3h 26m', '3h 24m', 'PG', '5h 16m', '5h 23m', '4h 48m', '3h 37m',
       '4h 2m', '44m', '4h 44m', '9h 26m', '3h 59m', '8h 5m', '5h 21m',
       '6h 33m', '3h 54m', '4h 7m', '6h 38m', '6h 14m', 'TV-G', '3h 28m',
       '4h 14m', '4h 18m', 'X', '5h 25m', 'TV-14', '5h 45m', '7h 19m',
       '12h 56m', '3h 23m'], dtype=object)

In [139]:
def convertDuration(val):
    li = val.split()
    if len(li)==2:
        return int(li[0][0:len(li[0])-1])*60+int(li[1][0:len(li[1])-1])
    elif li[0][-1]=='h':
        return int(li[0][0:len(li[0])-1])*60
    elif li[0][-1]=='m':
        return int(li[0][0:len(li[0])-1])
    else:
        return convertDuration(df.Duration.mode()[0])

In [145]:
df.Duration = df.Duration.map(convertDuration)

In [146]:
df.head(3)

,id,Title,Movie Link,Year,Duration,MPA,Rating,Votes,budget,grossWorldWide,...,writers,stars,genres,countries_origin,filming_locations,production_companies,Languages,wins,nominations,oscars
0,tt0073195,Jaws,https://www.imdb.com/title/tt0073195,1975,124,PG,8.1,683K,7000000.0,477220580.0,...,"['Peter Benchley', 'Carl Gottlieb']","['Roy Scheider', 'Robert Shaw', 'Richard Dreyf...","['Monster Horror', 'Sea Adventure', 'Survival'...",['United States'],"[""Water Street, Edgartown, Martha's Vineyard, ...","['Zanuck/Brown Productions', 'Universal Pictur...",['English'],0,20,0
1,tt0073629,The Rocky Horror Picture Show,https://www.imdb.com/title/tt0073629,1975,100,R,7.4,173K,1200000.0,115798478.0,...,"[""Richard O'Brien"", 'Jim Sharman']","['Tim Curry', 'Susan Sarandon', 'Barry Bostwick']","['Dark Comedy', 'Raunchy Comedy', 'Rock Musica...","['United Kingdom', 'United States']","['Oakley Court, Windsor Road, Oakley Green, Wi...","['Twentieth Century Fox', 'Michael White Produ...",['English'],0,4,0
2,tt0073486,One Flew Over the Cuckoo's Nest,https://www.imdb.com/title/tt0073486,1975,133,R,8.7,1.1M,3000000.0,109115366.0,...,"['Lawrence Hauben', 'Bo Goldman', 'Ken Kesey']","['Jack Nicholson', 'Louise Fletcher', 'Michael...","['Medical Drama', 'Psychological Drama', 'Drama']",['United States'],['Oregon State Mental Hospital - 2600 Center S...,"['Fantasy Films', 'N.V. Zvaluw']",['English'],0,15,0

In [148]:
df.Duration.mean()

np.float64(103.10729166666667)

In [149]:
df.Votes

0        683K
1        173K
2        1.1M
3        279K
4         15K
         ...
33595    1.1K
33596      12
33597    1.3K
33598     337
33599     737
Name: Votes, Length: 33600, dtype: object

In [150]:
df.Votes.unique()

array(['683K', '173K', '1.1M', ..., '901K', '557K', '977K'],
      shape=(1758,), dtype=object)

In [186]:
def convertVotes(val):
    val = str(val)
    if val[-1]=='K':
        return int(float(val[0:len(val)-1])*1000)
    elif val[-1]=='M':
        return int(float(val[0:len(val)-1])*1000000)
    else:
        return int(val)

In [189]:
df.Votes = df.Votes.map(convertVotes)

In [190]:
df.Votes

0         683000
1         173000
2        1100000
3         279000
4          15000
          ...
33595       1100
33596         12
33597       1300
33598        337
33599        737
Name: Votes, Length: 33600, dtype: int64

In [191]:
df.Votes.mean()

np.float64(30040.453154761904)